{"class_name": "Sequential", "config": [{"class_name": "Model", "config": {"name": "feature_extractor", "layers": [{"name": "autoencoder_input_layer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 4], "dtype": "float32", "sparse": false, "name": "autoencoder_input_layer"}, "inbound_nodes": []}, {"name": "autoencoder", "class_name": "Model", "config": {"name": "autoencoder", "layers": [{"name": "autoencoder_input_layer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 4], "dtype": "float32", "sparse": false, "name": "autoencoder_input_layer"}, "inbound_nodes": []}, {"name": "encoder_input_layer", "class_name": "LSTM", "config": {"name": "encoder_input_layer", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 4, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["autoencoder_input_layer", 0, 0, {}]]]}, {"name": "encoder_output_layer", "class_name": "LSTM", "config": {"name": "encoder_output_layer", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "sigmoid", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["encoder_input_layer", 0, 0, {}]]]}, {"name": "autoencoder_latent_output_layer", "class_name": "RepeatVector", "config": {"name": "autoencoder_latent_output_layer", "trainable": true, "n": 5}, "inbound_nodes": [[["encoder_output_layer", 0, 0, {}]]]}, {"name": "decoder_input_layer", "class_name": "LSTM", "config": {"name": "decoder_input_layer", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["autoencoder_latent_output_layer", 0, 0, {}]]]}, {"name": "decoder_output_layer", "class_name": "LSTM", "config": {"name": "decoder_output_layer", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 4, "activation": "linear", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["decoder_input_layer", 0, 0, {}]]]}], "input_layers": [["autoencoder_input_layer", 0, 0]], "output_layers": [["decoder_output_layer", 0, 0]]}, "inbound_nodes": [[["autoencoder_input_layer", 0, 0, {}]]]}], "input_layers": [["autoencoder_input_layer", 0, 0]], "output_layers": [["autoencoder", 1, 0]]}}], "keras_version": "2.2.2", "backend": "tensorflow"}