python3 tsf.py -a compile -o bce -m examples/occupancy/models/model_33_5_41 -rl 3 -dl 3 -ir 0.01 -dr 0.2 -w 5 -f 4 -p 1 -v

python3 tsf.py -a train -ds examples/occupancy/datasets/training_dataset.csv -m examples/occupancy/models/model_33_5_41.h5 -vs 0.4 -w 5 -f 4 -p 1 -ep 50 -b 128 -ilr 0.001 -v








_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_input_layer (LSTM)      (None, 5, 40)             7200
_________________________________________________________________
activation_1 (Activation)    (None, 5, 40)             0
_________________________________________________________________
lstm_hidden_layer_1 (LSTM)   (None, 5, 40)             12960
_________________________________________________________________
activation_2 (Activation)    (None, 5, 40)             0
_________________________________________________________________
lstm_output_layer (LSTM)     (None, 40)                12960
_________________________________________________________________
activation_3 (Activation)    (None, 40)                0
_________________________________________________________________
dense_input_layer (Dense)    (None, 40)                1640
_________________________________________________________________
activation_4 (Activation)    (None, 40)                0
_________________________________________________________________
dropout_1 (Dropout)          (None, 40)                0
_________________________________________________________________
dense_hidden_layer_1 (Dense) (None, 48)                1968
_________________________________________________________________
activation_5 (Activation)    (None, 48)                0
_________________________________________________________________
dropout_2 (Dropout)          (None, 48)                0
_________________________________________________________________
dense_hidden_layer_2 (Dense) (None, 18)                882
_________________________________________________________________
activation_6 (Activation)    (None, 18)                0
_________________________________________________________________
dropout_3 (Dropout)          (None, 18)                0
_________________________________________________________________
dense_output_layer (Dense)   (None, 1)                 19
_________________________________________________________________
activation_7 (Activation)    (None, 1)                 0
=================================================================
Total params: 37,629
Trainable params: 37,629
Non-trainable params: 0
_________________________________________________________________
