python3 tsf.py -a compile -o lcl -m examples/air_quality/models/model_33_2_71 -rl 3 -dl 3 -ir 0.002 -dr 0.2 -bn -w 2 -f 7 -ef 2 -p 1 -v

python3 tsf.py -a train -ds examples/air_quality/datasets/training_dataset.csv -m examples/air_quality/models/model_33_2_71.h5 -vs 0.5 -w 2 -f 7 -p 1 -ep 150 -b 1024 -ilr 0.005 -v





Model feature extractor compilation time: 0.014s
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
autoencoder_input_layer (Inp (None, 2, 7)              0
_________________________________________________________________
encoder_input_layer (LSTM)   (None, 2, 7)              420
_________________________________________________________________
encoder_output_layer (LSTM)  (None, 2)                 80
_________________________________________________________________
autoencoder_latent_output_la (None, 2, 2)              0
_________________________________________________________________
decoder_input_layer (LSTM)   (None, 2, 2)              40
_________________________________________________________________
decoder_output_layer (LSTM)  (None, 2, 7)              280
=================================================================
Total params: 820
Trainable params: 820
Non-trainable params: 0
_________________________________________________________________
None
Saved to binary file /Users/tuan/Projects/ml/tsf/examples/air_quality/models/model_33_2_71_fext.bin
Time series model compilation time: 0.021s
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_input_layer (LSTM)      (None, 2, 36)             6624
_________________________________________________________________
activation_1 (Activation)    (None, 2, 36)             0
_________________________________________________________________
batch_normalization_1 (Batch (None, 2, 36)             144
_________________________________________________________________
lstm_hidden_layer_1 (LSTM)   (None, 2, 36)             10512
_________________________________________________________________
activation_2 (Activation)    (None, 2, 36)             0
_________________________________________________________________
batch_normalization_2 (Batch (None, 2, 36)             144
_________________________________________________________________
lstm_output_layer (LSTM)     (None, 36)                10512
_________________________________________________________________
activation_3 (Activation)    (None, 36)                0
_________________________________________________________________
batch_normalization_3 (Batch (None, 36)                144
_________________________________________________________________
dense_input_layer (Dense)    (None, 36)                1332
_________________________________________________________________
activation_4 (Activation)    (None, 36)                0
_________________________________________________________________
batch_normalization_4 (Batch (None, 36)                144
_________________________________________________________________
dropout_1 (Dropout)          (None, 36)                0
_________________________________________________________________
dense_hidden_layer_1 (Dense) (None, 44)                1628
_________________________________________________________________
activation_5 (Activation)    (None, 44)                0
_________________________________________________________________
batch_normalization_5 (Batch (None, 44)                176
_________________________________________________________________
dropout_2 (Dropout)          (None, 44)                0
_________________________________________________________________
dense_hidden_layer_2 (Dense) (None, 17)                765
_________________________________________________________________
activation_6 (Activation)    (None, 17)                0
_________________________________________________________________
batch_normalization_6 (Batch (None, 17)                68
_________________________________________________________________
dropout_3 (Dropout)          (None, 17)                0
_________________________________________________________________
dense_output_layer (Dense)   (None, 1)                 18
_________________________________________________________________
activation_7 (Activation)    (None, 1)                 0
=================================================================
Total params: 32,211
Trainable params: 31,801
Non-trainable params: 410
_________________________________________________________________
